rt/databinding/aegis/src/test/java/org/apache/cxf/aegis/integration/takeNumber.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
 <env:Header/>
 <env:Body>
  <takeNumber xmlns="urn:Array">
  	<numberParam>123456789</numberParam>
  </takeNumber>
 </env:Body>
</env:Envelope>